'''
[Adventurers and Hidden Treasure] นักผจญภัยกับสมบัติลับ
คุณกำลังสำรวจถ้ำลึกลับและพบหีบสมบัติที่มีรหัสลับจารึกไว้ รหัสนี้ประกอบด้วยตัวอักษรและตัวเลขปะปนกัน ภารกิจของคุณคือคำนวณผลรวมของตัวเลขทั้งหมดในรหัสนี้ทีละหลักเพื่อเปิดหีบสมบัติ

จงเขียนโปรแกรมที่รับข้อความที่มีตัวเลขปะปนกับตัวอักษร แล้วหาผลรวมของตัวเลขทั้งหมดในข้อความนั้น

ตัวอย่าง 1

ป้อนรหัสลับ: a1b2c3
ผลลัพธ์: 6
ตัวอย่าง 2

ป้อนรหัสลับ: x5y10z15 0
ผลลัพธ์: 30
ตัวอย่าง 3

ป้อนรหัสลับ: no_numbers here
ผลลัพธ์: 0
'''

x = input("ป้อนรหัสลับ: ")
total = 0

tmp = 0
for i in x:
    if i.isdigit():
        tmp = tmp*10 + int(i)
    else:
        total = total + tmp
        tmp = 0
total = total + tmp
print(f"ผลลัพธ์: {total}")