'''
[date] เมื่อไหร่เราจะได้พบกันจุ้บ <3
ให้นิสิตพัฒนาโปรแกรมที่รับวันที่ตามปฏิทิน แล้วคำนวณลำดับของวันที่ดังกล่าวในปีนั้นๆ (1 ถึง 366)
ยกตัวอย่างเช่น
" 01/01/1994 " จะตรงกับวันในลำดับที่ 1
" 31/12/1993 " จะตรงกับวันในลำดับที่ 365
" 31/12/1996 " จะตรงกับวันในลำดับที่ 366 เนื่องจากปี 1996 เป็น ปีอธิกสุรทิน
( ปีอธิกสุรทิน สามารถคำนวณโดยเป็นปีที่หาร 4 ลงตัวแต่หาร 100 ไม่ลงตัว ยกเว้นปีที่หาร 400 ลงตัว )

ข้อมูลนำเข้า สามบรรทัดรับ วัน เดือน ปี ในรูปแบบ dd mm yyyy ตามลำดับ
ข้อมูลส่งออก บรรทัดเดียวแสดงผลลัพธ์ออกเป็นจำนวนเต็มที่บอกว่าวันที่รับมาเป็นวันที่เท่าไหร่ของปีนั้นๆ

Example 1
d: 01
m: 01
y: 1994
1
Example 2
d: 31
m: 12
y: 1994
365
Example 3
d: 31
m: 12
y: 1996
366
Example 4
d: 21
m: 02
y: 2000
52


'''

d = input("d: ")
m = input("m: ")
y = int(input("y: "))
count = [31,28,31,30,31,30,31,31,30,31,30,31]
day = 0
if m == 10:
    for i in range(int(m)-1):
        day += count[i]
else:
    m.replace("0","")
    for i in range(int(m)-1):
        day += count[i]
    
day += int(d)

if y % 4 == 0:
    day += 1
if y % 4 == 0 and int(m) < 2:
    day -= 1
if y % 400 == 0:
    day -= 1
print(day)