'''
Add & Remove
ในสัปดาห์นี้ น้องๆ ได้คงเรียนการใช้ list พื้นฐานกันบ้างแล้ว โจทย์ข้อนี้จะเป็นการฝึกให้น้องใช้การดำเนินการต่างๆ ของ list ให้ชำนาญมากยิ่งขึ้น

จงรับค่าจำนวนเต็ม แล้วนำตัวเลขเหล่านั้นเก็บเข้าใน list และรับคำสั่งในการเปลี่ยนแปลง list จนกว่าผู้ใช้จะป้อนคำสั่งให้หยุด เมื่อจบคำสั่งแล้ว ให้แสดงหน้าตาของ list ล่าสุดด้วย

โดยโปรแกรมจะมีการดำเนินการต่างๆ ดังนี้

รูปแบบคำสั่ง	คำอธิบายของคำสั่ง
A x	เพิ่มจำนวนเต็ม x ต่อท้ายลงใน list
S x	แสดงข้อมูลของ list ในช่องที่ x (ช่องเริ่มต้นที่ 0 และรับประกันชุดข้อมูลทดสอบว่าจะไม่เรียกแสดงช่องข้อมูลที่เกินขนาดของ list)
R x	ลบข้อมูลใน list ช่องที่ x
E 0	คำสั่งบอกการยกเลิกรับคำสั่งของผู้ใช้
คำแนะนำในการรับค่า

ส่วนการรับค่าตัวเลขลงใน list 
A = list(map(int,input().split()))

===================

ส่วนการรับค่าคำสั่ง
menu,x = input().split()
x = int(x)

ในที่นี้เราจะได้ menu เป็นตัวแปรประเภท string และ x เป็น integer
Example 1
1 2 3 4 5
A 100
A 200
S 6
200
R 5
E 0
1 2 3 4 5 200
Example 2
1 2 3 4 5
R 0
R 0
R 0
R 0
R 0
E 0
'''

A = list(map(int,input().split()))

while True:
    menu,x = input().split()
    x = int(x)
    if menu.lower() == "a":
        A.append(x)
    elif menu.lower() == "s":
        print(A[x])
    elif menu.lower() == "r":
        A.pop(x)
    elif menu.lower() == "e" and x == 0:
        for i in range(len(A)):
            if i+1 == len(A):
                print(A[i])
                break
            else:
                print(A[i],end = " ")
        break
