'''
ซอมบี้
น้องและเพื่อนของน้องตัดสินใจที่จะไปหาสะเบียงมาเติมเพราะใกล้จะหมดลง แต่ว่าทั้งเมืองเต็มไปด้วยซอมบี้ เมื่อน้องและเพื่อนของน้องออกไปหาสะเบียงก็เจอซอมบี้ m ตัว แต่น้องและเพื่อนของน้องรวมกันมี n คน น้องและเพื่อนๆแต่ละคนต้องงัดความเป็นนักเลงออกมาโดยการต่อสู้กับซอบบี้ 1-1 โดยที่แต่ละคนจะใช้เวลาสู้ที่ต่างกัน น้องจะต้องหาว่าเวลาที่น้อยที่สุดที่น้องและเพื่อนๆของน้องสู้กับซอมบี้เป็นเวลาเท่าไหร่

ชะตากรรมของโลก อยู่ในมือของน้องแล้ว

ข้อมูลนําเข้า
บรรทัดที่ 1 รับจำนวนคน n และจำนวนซอมบี้ m ตามลำดับ ใช้ space เพื่อแยก n และ m
n บรรทัดต่อมา รับเวลา t ของแต่ละคนที่ใช้สู้กับซอมบี้

ข้อมูลส่งออก
บรรทัดเดียว เวลาที่ใช้ที่น้อยที่สุดในการจัดการกับซอมบี้ทุกตัว

ขอบเขตของตัวแปร
1 <= n,m<=10000
1 <= t<=100000

ตัวอย่างการทำงาน
Example Test Case 1

2 6
7
10
28
Example Test Case 2

7 10
3
8
3
6
9
2
4
8


'''

n, m = map(int, input().split())
times = []
for i in range(n):
    times.append(int(input()))

def can_finish_in_time(max_time):
    total_zombies_can_kill = 0
    for time in times:
        total_zombies_can_kill += max_time // time
    return total_zombies_can_kill >= m

left = 1
right = max(times) * m

while left < right:
    mid = (left + right) // 2
    if can_finish_in_time(mid):
        right = mid
    else:
        left = mid + 1

print(left)