'''
[Cross Box]
จงเขียนโปรแกรมที่รับค่า N ซึ่งเป็นจำนวนเต็มบวกคี่จากผู้ใช้ โดยที่ N ≥ 9 จากนั้นโปรแกรมจะพิมสี่เหลี่ยมพร้อมเส้นทแยงมุมอยู่ภายใน ดังแสดงในตัวอย่างข้างล่าง

Example 1
9
.........
..     ..
. .   . .
.  . .  .
.   .   .
.  . .  .
. .   . .
..     ..
.........
Example 2
11
...........
..       ..
. .     . .
.  .   .  .
.   . .   .
.    .    .
.   . .   .
.  .   .  .
. .     . .
..       ..
...........
Example 3
13
.............
..         ..
. .       . .
.  .     .  .
.   .   .   .
.    . .    .
.     .     .
.    . .    .
.   .   .   .
.  .     .  .
. .       . .
..         ..
.............
Example 4
15
...............
..           ..
. .         . .
.  .       .  .
.   .     .   .
.    .   .    .
.     . .     .
.      .      .
.     . .     .
.    .   .    .
.   .     .   .
.  .       .  .
. .         . .
..           ..
...............


'''

x = int(input())
y =0
print("."*x)
for i in range((x-2)//2):
    print("."+" "*i+"."+" "*((x-4)-(i*2))+"."+" "*i+".")
    y += 1
print("."+" "*y+"."+" "*y+".")
for i in range((x-2)//2):
    print("."+" "*(y-(i+1))+"."+" "*(1+(i*2))+"."+" "*(y-(i+1))+".")
print("."*x)
